[{"title":"AVSpeechSynthesizer: Making iOS Talk","genre":"App Store and Distribution","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/236/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/236mwbxbxjfsvns4jan/236/hls_vod_mvp.m3u8","summaryText":"Speech can enhance the audio experience of your app, whether you are generating spoken feedback for accessibility, or providing critical information beyond simple alerts or notifications. AVSpeechSynthesizer produces synthesized speech from text and allows you to control and monitor the progress of ongoing speech. Learn the ins and outs of AVSpeechSynthesizer and how to add computer-generated speech output to your app.","sessionDetail":"WWDC 2018 - Session 236 - iOS"},{"title":"Accessible Drag and Drop","genre":"App Store and Distribution","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/241/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/241fyqqiogmd6sv/241/hls_vod_mvp.m3u8","summaryText":"Drag and Drop is a powerful API that allows apps to share and communicate data. No matter how you decide to implement Drag and Drop, there's a way to make it work for people with accessibility needs. Learn the details as we dive into accessible Drag and Drop for iOS.","sessionDetail":"WWDC 2018 - Session 241 - iOS"},{"title":"Automating App Store Connect","genre":"App Store and Distribution","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/303/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/303ewlysk7t1l43/303/hls_vod_mvp.m3u8","summaryText":"The new App Store Connect API provides a familiar and highly readable REST API designed to facilitate the automation of many tasks you would typically perform through the Apple Developer website and the App Store Connect browser interfaces. Learn how this API allows you to manage your apps and testers for TestFlight, create code signing resources, download reports, and even manage your organization. See how this API leverages JWT authentication and a JSON payload for all transactions to make this new service easy to integrate with your existing automated workflows.","sessionDetail":"WWDC 2018 - Session 303 - iOS, macOS, tvOS, watchOS"},{"title":"Best Practices and What’s New with In-App Purchases","genre":"App Store and Distribution","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/704/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/704n9oeu4famgn/704/hls_vod_mvp.m3u8","summaryText":"Learn about the latest updates in StoreKit, including offering introductory pricing for subscriptions, requesting ratings and reviews, promoting your in-app purchases within the App Store, and developing in the sandbox environment. Dive deep into best practices for processing transactions and validating receipts.","sessionDetail":"WWDC 2018 - Session 704 - iOS, macOS, tvOS"},{"title":"Deliver an Exceptional Accessibility Experience","genre":"App Store and Distribution","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/230/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/230bqynnqagiq4p8/230/hls_vod_mvp.m3u8","summaryText":"Go beyond the basics and create apps with an exceptional accessibility experience. Learn how to design elements that appear in your app for maximum clarity and accessibility. Discover how to enhance the way users interact with your app even when presenting custom views, or drawing complex UI.","sessionDetail":"WWDC 2018 - Session 230 - iOS, macOS, tvOS, watchOS"},{"title":"Engineering Subscriptions","genre":"App Store and Distribution","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/705/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/705u9699a9lzqsghf2c/705/hls_vod_mvp.m3u8","summaryText":"Learn the best practices for architecting your subscription infrastructure using StoreKit and server-side logic. Find out about simple engineering techniques to keep your subscribers longer, and how to utilize new tools and APIs to give your subscribers the best experience.","sessionDetail":"WWDC 2018 - Session 705 - iOS, macOS, tvOS"},{"title":"Getting Ready for Business Chat","genre":"App Store and Distribution","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/232/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/232mj2p4q92uls5n/232/hls_vod_mvp.m3u8","summaryText":"Business Chat is a powerful way for organizations to connect with customers directly from within Messages. Whether you are a Customer Service Platform provider, a brand looking to integrate chat for customer communication, or a brand app developer looking to extend your iOS app to enhance Business Chat conversations, you'll receive concrete guidance and learn the baseline requirements necessary to ensure you are ready to go live.","sessionDetail":"WWDC 2018 - Session 232 - iOS"},{"title":"VoiceOver: App Testing Beyond The Visuals","genre":"App Store and Distribution","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/226/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/226s1li4vc2mjvj4j/226/hls_vod_mvp.m3u8","summaryText":"VoiceOver provides spoken descriptions and braille output of onscreen elements. Learn how to go beyond the visuals to identify VoiceOver and functional issues to help improve the experience for all users.","sessionDetail":"WWDC 2018 - Session 226 - iOS"},{"title":"What's New in App Store Connect","genre":"App Store and Distribution","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/301/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/301k4gd0t7y955ppg/301/hls_vod_mvp.m3u8","summaryText":"App Store Connect is constantly evolving to improve the experience of managing and deploying your app on App Store. Learn about the new App Store Connect API for managing frequently modified data such as users and groups, see the latest updates to Sales Trends and Analytics reporting, and TestFlight features enhanced to help you test and deploy your next masterpiece.","sessionDetail":"WWDC 2018 - Session 301 - iOS, macOS, tvOS, watchOS"},{"title":"What's New in Managing Apple Devices","genre":"App Store and Distribution","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/302/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/302tw1pd3hkgmzuw47/302/hls_vod_mvp.m3u8","summaryText":"Learn about new management capabilities for iOS, macOS, and tvOS, tool evolution over the past year, and important changes coming this fall. You'll discover how new MDM features help administrators manage devices more effectively, how educators can enhance the classroom learning environment, and how app developers can make their app a better fit for education and enterprise customers.","sessionDetail":"WWDC 2018 - Session 302 - iOS, macOS, tvOS, watchOS"},{"title":"What's New in Search Ads","genre":"App Store and Distribution","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/304/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/304o1mulfeyvd4wd/304/hls_vod_mvp.m3u8","summaryText":"Search Ads is a great way to help people discover your app in App Store search results. Learn how new market expansion will give you greater opportunities to reach high quality customers. See how Search Ads Advanced new creative variations will help make your app promotion even more effective.","sessionDetail":"WWDC 2018 - Session 304 - iOS"},{"title":"Advanced Debugging with Xcode and LLDB","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/412/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/412zw88j5aa4mr9/412/hls_vod_mvp.m3u8","summaryText":"Discover advanced techniques, and tips and tricks for enhancing your Xcode debugging workflows. Learn how to take advantage of LLDB and custom breakpoints for more powerful debugging. Get the most out of Xcode's view debugging tools to solve UI issues in your app more efficiently.","sessionDetail":"WWDC 2018 - Session 412 - iOS, macOS, tvOS, watchOS"},{"title":"Behind the Scenes of the Xcode Build Process","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/415/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/415o65ozc2l1bc3/415/hls_vod_mvp.m3u8","summaryText":"Ever wonder what happens when you build your project in Xcode? Learn how Xcode automates the steps required to build an application, and go behind the scenes to learn how clang, swiftc, and the linker work together to turn your source code into a working program.","sessionDetail":"WWDC 2018 - Session 415 - iOS, macOS, tvOS, watchOS"},{"title":"Building Faster in Xcode","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/408/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/408bhgyeffq8acmv/408/hls_vod_mvp.m3u8","summaryText":"Build your apps faster in Xcode 10. Learn how to structure your projects and tweak your code to take full advantage of all processor cores. Whether you've made a few small code changes you want to give a try, or you're building your full app for release, these techniques will cut the time it takes to build a running app.","sessionDetail":"WWDC 2018 - Session 408 - iOS, macOS, tvOS, watchOS"},{"title":"Core Data Best Practices","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/224/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/224esqliuhnac9p11/224/hls_vod_mvp.m3u8","summaryText":"As your app gains more customers and becomes more feature-rich, you may find yourself with new problems to solve. Core Data is a powerful tool that has changed a lot over the years. Learn about the new best practices in Core Data, such as how to use concurrency and persistent history, and discover how to test for, and resolve, common problems using familiar technologies.","sessionDetail":"WWDC 2018 - Session 224 - iOS, macOS, tvOS, watchOS"},{"title":"Create Your Own Swift Playgrounds Subscription","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/413/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/413mapolqk6ca7mozr/413/hls_vod_mvp.m3u8","summaryText":"Swift Playgrounds is a revolutionary iPad app to teach coding with the powerful Swift programming language. Learn how to create your own content for Swift Playgrounds using the new template, and find out how to use the subscription format to host your own feed online for others to access.","sessionDetail":"WWDC 2018 - Session 413 - iOS"},{"title":"Creating Custom Instruments","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/410/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/410naz8a8zy0rq9cg/410/hls_vod_mvp.m3u8","summaryText":"Understand how custom instruments are useful and when they should be used. Get an in-depth view of the architecture of custom instruments and how to create them. Understand the attributes of a good instrument. Dive into advanced modeling and how to use the CLIPS language.","sessionDetail":"WWDC 2018 - Session 410 - iOS, macOS, tvOS, watchOS"},{"title":"Data You Can Trust","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/222/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/222krhixqaeggyrn33/222/hls_vod_mvp.m3u8","summaryText":"A lot can go wrong when loading data into your app. Whether you work directly with JSON and property lists, or with higher-level APIs such as NSCoding and Codable, learn how to defend your customers and secure your code against invalid or malicious data. Avoid fatal assumptions by validating payload structure, type information and domain correctness, to turn the data you work with into data you can trust.","sessionDetail":"WWDC 2018 - Session 222 - iOS, macOS"},{"title":"Embracing Algorithms","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/223/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/223plbqb0sfpv80/223/hls_vod_mvp.m3u8","summaryText":"When you imagine building a new app, what do you think about? Models, views, and controllers deserve their prominent place in the design process, but we don't often give the same attention to the underlying work our apps need to do. Understand how to identify and optimize the algorithms in your app, and discover how implementing algorithms as generic protocol extensions results in efficient, effective, and maintainable code.","sessionDetail":"WWDC 2018 - Session 223 - iOS, macOS, tvOS, watchOS"},{"title":"Getting the Most out of Playgrounds in Xcode","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/402/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/402ta235oio1spobfi/402/hls_vod_mvp.m3u8","summaryText":"Discover major advancements in Xcode playgrounds. Learn advanced tips and techniques, hear about new and often overlooked workflows, and rediscover the tools provided when coding in playgrounds.","sessionDetail":"WWDC 2018 - Session 402 - iOS, macOS"},{"title":"Getting to Know Swift Package Manager","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/411/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/411gl7b9ztm2imp/411/hls_vod_mvp.m3u8","summaryText":"The Swift Package Manager makes it possible to easily develop and distribute source code in the Swift ecosystem. Learn about its goals, design, unique features, and the opportunities it has for continued evolution.","sessionDetail":"WWDC 2018 - Session 411 - macOS"},{"title":"Introducing Dark Mode","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/210/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/210y2fene7yk01/210/hls_vod_mvp.m3u8","summaryText":"Hear from the Apple design team about the principles and concepts that anchor Dark Mode. Learn the basics of enhancing your app with this new appearance, and add an experience that people are sure to love.","sessionDetail":"WWDC 2018 - Session 210 - macOS"},{"title":"Measuring Performance Using Logging","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/405/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/405bjty1j94taqv8ii/405/hls_vod_mvp.m3u8","summaryText":"Learn how to use signposts and logging to measure performance.  Understand how the Points of Interest instrument can be used to examine logged data. Get an introduction into creating and using custom instruments.","sessionDetail":"WWDC 2018 - Session 405 - iOS, macOS, tvOS, watchOS"},{"title":"Metal for Accelerating Machine Learning","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/609/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/609yyw42hw6wq6mte8p/609/hls_vod_mvp.m3u8","summaryText":"Metal Performance Shaders (MPS) includes a highly tuned library of machine learning primitives leveraging the tremendous power of the GPU. With iOS 12 and macOS Mojave, MPS adds capabilities to accelerate the computationally intensive task of training a neural network. Learn performance optimizations for inference, and understand the training process for both convolutional and recurrent neural networks (CNNs and RNNs).","sessionDetail":"WWDC 2018 - Session 609 - iOS, macOS, tvOS"},{"title":"New Localization Workflows in Xcode 10","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/404/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/404cpduaxf6gola/404/hls_vod_mvp.m3u8","summaryText":"The localization process in Xcode 10 has been updated to aid you through the lifecycle of exporting, importing, and testing localized content in your apps. See new functionality added in Xcode 10 and learn how the new localization catalog helps you build world-class, localized apps.","sessionDetail":"WWDC 2018 - Session 404 - iOS, macOS, tvOS, watchOS"},{"title":"Optimizing App Assets","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/227/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/227r61xi77ucgjz6zm/227/hls_vod_mvp.m3u8","summaryText":"Learn how to use assets to bring visually compelling and data efficient artwork to your apps, leveraging new features in iOS 12. Gain insight into organizing, optimizing, and authoring artwork assets by using asset catalogs to their fullest. Learn techniques to better streamline workflows between designers and developers. Ensure better app delivery and a smaller footprint, maximizing target audiences of your app with full artwork asset fidelity.","sessionDetail":"WWDC 2018 - Session 227 - iOS, macOS, tvOS"},{"title":"Practical Approaches to Great App Performance","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/407/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/407akll3nbwls9yn4qt/407/hls_vod_mvp.m3u8","summaryText":"All apps benefit from a focus on performance and an increase in overall responsiveness. This information packed session gives you strategies for fixing performance problems using Instruments and other tools. Additionally, get practical advice based on experience in tuning Apple's own apps including Xcode and Photos on iOS.","sessionDetail":"WWDC 2018 - Session 407 - iOS, macOS, tvOS, watchOS"},{"title":"Presenting Design Work","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/811/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/811tcr2wk13t3uq/811/hls_vod_mvp.m3u8","summaryText":"Ideas can live or die by their presentation. Learn indispensable and proven techniques for presenting your design work to better communicate your objectives and receive helpful, valuable and constructive feedback.","sessionDetail":"WWDC 2018 - Session 811 - iOS, macOS"},{"title":"Source Control Workflows in Xcode","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/418/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/418ernlc0c54xrb8sn/418/hls_vod_mvp.m3u8","summaryText":"Xcode integrates with GitHub, Bitbucket, and GitLab to help you manage your source code, back up your files, and collaborate with others. Find out how to easily see the changes in your project right in the source editor, and learn how to use Xcode for common source control workflows with Git. See how conflicts occur, how to resolve them, and how to avoid them before they even happen.","sessionDetail":"WWDC 2018 - Session 418 - iOS, macOS, tvOS, watchOS"},{"title":"Swift Generics (Expanded)","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/406/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/406z8wpyv2jdenet9rc/406/hls_vod_mvp.m3u8","summaryText":"Generics are one of the most powerful features of Swift, enabling you to write flexible, reusable components while maintaining static type information. Learn about the design of Swift's generics, including how to generalize protocols, leverage protocol inheritance to express the varying capabilities of related types, build composable generic components with conditional conformances, and reason about the interaction between class inheritance and generics. This expanded version of the WWDC 2018 session includes a brand-new discussion of recursive constraints.","sessionDetail":"WWDC 2018 - Session 406 - iOS, macOS, tvOS, watchOS"},{"title":"Testing Tips & Tricks","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/417/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/417j8ucs9p8w7seip/417/hls_vod_mvp.m3u8","summaryText":"Testing is an essential tool to consistently verify your code works correctly, but often your code has dependencies that are out of your control. Discover techniques for making hard-to-test code testable on Apple platforms using XCTest. Learn a variety of tips for writing higher-quality tests that run fast and require less maintenance.","sessionDetail":"WWDC 2018 - Session 417 - iOS, macOS, tvOS"},{"title":"Understanding Crashes and Crash Logs","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/414/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/414djzbkfdpkvf50/414/hls_vod_mvp.m3u8","summaryText":"Sudden app crashes are a source of bad user experience and app review rejections. Learn how crash logs can be analyzed, what information they contain and how to diagnose the causes of crashes, including hard-to-reproduce memory corruptions and multithreading issues.","sessionDetail":"WWDC 2018 - Session 414 - iOS, macOS, tvOS, watchOS"},{"title":"Using Collections Effectively","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/229/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/229aa99vrkiplc/229/hls_vod_mvp.m3u8","summaryText":"Every app uses collections! Go beyond the basics with specific tips on how best to use indices, slices, bridging, laziness, and reference types. Gain better understanding of when to use each collection for best performance.","sessionDetail":"WWDC 2018 - Session 229 - macOS"},{"title":"What's New in Cocoa for macOS","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/209/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/209pydirtfgavpnj/209/hls_vod_mvp.m3u8","summaryText":"Gain insights into the latest in Cocoa frameworks for macOS. Hear about Dark Mode, control tinting, contextual workflows for Touch Bar and Finder, and other improvements in AppKit, Foundation, and related areas. Get an overview and guide to the sessions that we have this year covering advancements in Cocoa.","sessionDetail":"WWDC 2018 - Session 209 - macOS"},{"title":"What's New in LLVM","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/409/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/409t8zw7rumablsh/409/hls_vod_mvp.m3u8","summaryText":"The LLVM suite of compiler tools in Xcode 10 have new language features, improved diagnostics, and more powerful optimizations. Find out about improvements to ARC for Objective-C, keep up with the newest additions to C++, get an overview of new and improved diagnostics and static analyzer checks, and learn about how LLVM compiler technology is delivering faster build times and better runtime performance for your apps.","sessionDetail":"WWDC 2018 - Session 409 - iOS, macOS, tvOS, watchOS"},{"title":"What's New in Swift","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/401/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/401ieeclipzse3tz3fg/401/hls_vod_mvp.m3u8","summaryText":"Hear about the latest advancements in Swift, the safe, fast, and expressive language. Find out about improvements to build times, code size, and runtime performance. Learn how to take advantage of new features in your code that eliminate boilerplate, increase safety and security, and improve your overall development productivity.","sessionDetail":"WWDC 2018 - Session 401 - iOS, macOS, tvOS, watchOS"},{"title":"What's New in Testing","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/403/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/403r3eh2u29dfeml/403/hls_vod_mvp.m3u8","summaryText":"Hear about exciting improvements to code coverage, including how you can build your own automation on top of Xcode's coverage reports. Learn how to dramatically speed up the execution of your tests by leveraging distributed parallel testing, new in Xcode 10.","sessionDetail":"WWDC 2018 - Session 403 - iOS, macOS, tvOS"},{"title":"What’s New in Energy Debugging","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/228/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/228cp3feot1iav3gy4x/228/hls_vod_mvp.m3u8","summaryText":"People expect long battery life on their mobile devices, and apps play a vital role in achieving that experience. Understand how app behavior affects battery consumption, and learn strategies to conserve energy while providing the best experience for your app. Find out how Xcode Energy Reports can help you tune your app to use the least amount of power possible.","sessionDetail":"WWDC 2018 - Session 228 - iOS"},{"title":"iOS Memory Deep Dive","genre":"Developer Tools","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/416/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/416n2fmzz0fz88f/416/hls_vod_mvp.m3u8","summaryText":"Discover how memory graphs can be used to get a close up look at what is contributing to an app's memory footprint. Understand the true memory cost of an image. Learn some tips and tricks for reducing the memory footprint of an app.","sessionDetail":"WWDC 2018 - Session 416 - iOS, tvOS, watchOS"},{"title":"Apple Design Awards","genre":"Featured","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/103/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/103zvtnsrnrijr/103/hls_vod_mvp.m3u8","summaryText":"Join us for an unforgettable award ceremony celebrating developers and their outstanding work. The 2018 Apple Design Awards recognize state of the art iOS, macOS, watchOS, and tvOS apps that reflect excellence in design and innovation.","sessionDetail":"WWDC 2018 - Session 103 - iOS, macOS, tvOS, watchOS"},{"title":"Platforms State of the Union","genre":"Featured","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/102/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/102ly3xmvz1ssb1ill/102/hls_vod_mvp.m3u8","summaryText":"2018 Platforms State of the Union","sessionDetail":"WWDC 2018 - Session 102 - iOS, macOS, tvOS, watchOS"},{"title":"WWDC 2018 Keynote","genre":"Featured","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/101/","m3uUrl":"https://p-events-delivery.akamaized.net/18oijbasfvuhbfsdvoijhbsdfvljkb6/m3u8/hls_vod_mvp.m3u8","summaryText":"WWDC 2018 Keynote","sessionDetail":"WWDC 2018 - Session 101 - iOS, macOS, tvOS, watchOS"},{"title":"A Guide to Turi Create","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/712/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/712rgcvlbuehdk/712/hls_vod_mvp.m3u8","summaryText":"Turi Create is an open source toolset for creating Core ML models, for tasks such as image classification, object detection, style transfers, recommendations, and more. Learn how you can use Turi Create to build models for your apps.","sessionDetail":"WWDC 2018 - Session 712 - iOS, macOS, tvOS, watchOS"},{"title":"A Tour of UICollectionView","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/225/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/225s90wcvt1fjg6b/225/hls_vod_mvp.m3u8","summaryText":"UICollectionView is a flexible, powerful tool to help you achieve great user experiences in your applications. Hear how you can leverage these rich APIs to rapidly move from initial design ideas to polished shipping applications. Topics range from getting started to advanced update animations and layouts.","sessionDetail":"WWDC 2018 - Session 225 - iOS"},{"title":"Accessing Health Records with HealthKit","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/706/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/706pjh63zj75v07w6/706/hls_vod_mvp.m3u8","summaryText":"HealthKit provides a consolidated repository for a variety of data including health records containing information such as lab results, immunizations, and medications downloaded directly from institutions. Discover new health records classes and types created to provide easy access to high-level record types without preventing access to the underlying raw data.  Learn new authorization techniques that allows your app to access health record data for analysis and presentation in a manner that respects your customer's privacy.","sessionDetail":"WWDC 2018 - Session 706 - iOS, watchOS"},{"title":"Adding Delight to your iOS App","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/233/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/233uq0n4zauq0ili/233/hls_vod_mvp.m3u8","summaryText":"iOS contains powerful technologies you can use to make your app truly delightful. Learn how to take your app to the next level with easy-to-implement features such as Handoff and External Display support. Preserve that feeling of magic in your app with pro-tips that combine animations, gestures and layout, while keeping your scrolling smooth, and your code scalable. Dive into the anatomy of a launch to get your app responsive quickly, and learn some great debugging tricks from the pros!","sessionDetail":"WWDC 2018 - Session 233 - iOS"},{"title":"Advanced Dark Mode","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/218/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/218o6oial8c68yom/218/hls_vod_mvp.m3u8","summaryText":"Step deeper into Dark Mode adoption in your macOS application. Learn about the powerful Cocoa technologies at the core of Dark Mode, and take a detailed look at the APIs and best practices for adapting to this beautiful new look.","sessionDetail":"WWDC 2018 - Session 218 - macOS"},{"title":"Advances in Research and Care Frameworks","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/205/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/205tyzmd4sury4r/205/hls_vod_mvp.m3u8","summaryText":"HealthKit, CoreMotion, and other iOS frameworks combined with the ResearchKit and CareKit open-source projects, provide a deep platform for the creation of game-changing apps for care teams, researchers, and the medical community. Discover new active tasks that leverage calibrated device data and how new CoreMotion APIs deliver insightful results capable of assisting diagnosis and improving care. Hear about updates and contributions from the open-source community and gain practical guidance you need to rapidly deliver your next research or care app.","sessionDetail":"WWDC 2018 - Session 205 - iOS"},{"title":"Apple Pencil Design Essentials","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/809/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/809kx2o95wevp48/809/hls_vod_mvp.m3u8","summaryText":"Make your apps even more powerful and expressive with Apple Pencil. Learn Apple Pencil design best practices such as correctly balancing touch and pencil interactions, fully harnessing Apple Pencil sensors, and creating more efficient and natural user flows.","sessionDetail":"WWDC 2018 - Session 809 - iOS"},{"title":"Automatic Strong Passwords and Security Code AutoFill","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/204/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/204jfuuku83cex/204/hls_vod_mvp.m3u8","summaryText":"Passwords and security codes are a modern necessity required for security and privacy. iOS 12 eases the tedious aspects of account setup and sign-in by automatically suggesting and using strong, unique passwords — even from within apps —  and by bringing one-time codes to the QuickType bar so users can fill them with one tap. Learn how to optimize your app to ensure that password, security code, and other AutoFill features provide a seamless way for your users to be more secure.","sessionDetail":"WWDC 2018 - Session 204 - iOS, macOS, tvOS"},{"title":"Better Apps through Better Privacy","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/718/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/718twnl0ca4qp1rrm7/718/hls_vod_mvp.m3u8","summaryText":"At Apple, we believe in building products with both great features and great privacy. Learn how to apply privacy engineering techniques to your apps so you can build trust with users to unlock better experiences and engagement.  And find out how new privacy features can benefit you and your users.","sessionDetail":"WWDC 2018 - Session 718 - iOS, macOS, tvOS, watchOS"},{"title":"Building for Voice with Siri Shortcuts","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/214/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/214w2w1racklnrc0l/214/hls_vod_mvp.m3u8","summaryText":"Siri Shortcuts are a great way to help people execute actions or get information from your app, but shortcuts can be made even more powerful by adding them to Siri to be used with a simple phrase. Learn how you can now customize responses from Siri and add custom UI to make a great shortcuts experience across iOS, watchOS and HomePod. See how to allow users to add and manage shortcuts from right within your app and learn best practices to make shortcut suggestions that can be exposed through Settings.","sessionDetail":"WWDC 2018 - Session 214 - iOS, watchOS"},{"title":"CarPlay Audio and Navigation Apps","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/213/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/213ivbgp77y4z4/213/hls_vod_mvp.m3u8","summaryText":"Learn how to update your audio or navigation app to support CarPlay. Apps in CarPlay are optimized for use in the car, and automatically adapt to available vehicle screens and input controls. Audio apps can deliver music, news, podcasts, and more. With the new CarPlay framework, Navigation apps can provide detailed maps, destination search, turn-by-turn guidance, and user notifications.","sessionDetail":"WWDC 2018 - Session 213 - iOS"},{"title":"Creating Apps for a Global Audience","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/201/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/201bam0z9pcq7bs5km/201/hls_vod_mvp.m3u8","summaryText":"Common assumptions can break when your app is used by a global audience. Learn about the many aspects of creating apps for different regions and languages. Understand how to use fonts and typography, layout techniques, and support text input so your app shines in all languages.","sessionDetail":"WWDC 2018 - Session 201 - iOS, macOS, tvOS, watchOS"},{"title":"Designing Fluid Interfaces","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/803/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/803lpnlacvg2jsndx/803/hls_vod_mvp.m3u8","summaryText":"Discover the techniques used to create the fluid gestural interface of iPhone X. Learn how to design with gestures and motion that feel intuitive and natural, making your app a delight to use.","sessionDetail":"WWDC 2018 - Session 803 - iOS, macOS, tvOS, watchOS"},{"title":"Designing Notifications","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/806/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/806d34jrsj444iqhb/806/hls_vod_mvp.m3u8","summaryText":"Thoughtfully designed notifications are a powerful way to communicate timely information to people that they will find valuable and useful. Learn how you can design notifications people want to receive by making them beautiful, helpful, actionable, and respectful of their valuable time and attention.","sessionDetail":"WWDC 2018 - Session 806 - iOS, macOS, watchOS"},{"title":"Designing Web Content for watchOS","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/239/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/239oqke16leldnu3010/239/hls_vod_mvp.m3u8","summaryText":"watchOS 5 brings web content to Apple Watch by rendering rich HTML in Messages and Mail. Gain insights into how watchOS maintains compatibility with existing web content, and find out what you can do to optimize your web content for Apple Watch.","sessionDetail":"WWDC 2018 - Session 239 - watchOS"},{"title":"Getting and Using a MapKit JS Key","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/508/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/508g9tgxpjyfuwr1ap/508/hls_vod_mvp.m3u8","summaryText":"MapKit JS uses the JWT standard for ensuring a secure connection between your site and the MapKit JS services.  Learn how to create, protect, and use site-specific keys to ensure only your servers are accessing APIs linked to your domain.","sessionDetail":"WWDC 2018 - Session 508 - iOS, macOS"},{"title":"High Performance Auto Layout","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/220/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/220f49ijgby0rma/220/hls_vod_mvp.m3u8","summaryText":"Get a glimpse inside to find out what happens when you add a constraint! Dive into the internals of Auto Layout to develop intuition for how your code affects what happens under the hood. Learn how to measure and refine your approach to Auto Layout and see how its improved performance in iOS 12 will speed up your app.","sessionDetail":"WWDC 2018 - Session 220 - iOS"},{"title":"HomeKit Deep Dive","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/231/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/231yewsuorvvh0v47z/231/hls_vod_mvp.m3u8","summaryText":"Get a fresh look at the HomeKit APIs. Understand how Siri and the Apple Home App use Action Sets and Accessory Services & Characteristics to provide a great home automation experience.","sessionDetail":"WWDC 2018 - Session 231 - iOS, tvOS, watchOS"},{"title":"I Have This Idea For An App...","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/203/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/203zyni18c4phf/203/hls_vod_mvp.m3u8","summaryText":"Do you have an idea for an app that you think would be useful to others, but you don't know how to make it a reality? You're not alone! Lots of people are interested in app development, but they aren't sure how to turn their idea to code and then into a finished app. From first steps to Xcode, we'll explain the building blocks you need to turn your iOS app idea into reality.","sessionDetail":"WWDC 2018 - Session 203 - iOS"},{"title":"Implementing AutoFill Credential Provider Extensions","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/721/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/721w2b36lz4yno7f4/721/hls_vod_mvp.m3u8","summaryText":"Password AutoFill delivers the ability to fill passwords seamlessly within iOS apps and Safari. Join us to learn how app developers who provide credential management can surface their credentials during sign-in within apps and on the web.","sessionDetail":"WWDC 2018 - Session 721 - iOS, macOS"},{"title":"Intentional Design","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/802/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/802shgxe9sj19r/802/hls_vod_mvp.m3u8","summaryText":"Great app experiences leap off the screen. They are dynamic, immersive, personal, and, above all else, the result of a strong and clear intent. Learn key techniques for being intentional with your design by choosing appropriate metaphors, making extreme choices, and making every interaction feel more authentic and natural.","sessionDetail":"WWDC 2018 - Session 802 - iOS, macOS, tvOS, watchOS"},{"title":"Introducing ClassKit","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/215/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/215xraudwwyzg2lgu2l/215/hls_vod_mvp.m3u8","summaryText":"The new ClassKit framework lets you organize educational content in your app so that teachers can discover and assign specific activities and view students' progress in the new Schoolwork app. Learn how to adopt ClassKit to your content structure, declare assignable content, and share student progress on activities teachers assign in Schoolwork.","sessionDetail":"WWDC 2018 - Session 215 - iOS"},{"title":"Introducing Create ML","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/703/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/703r5lx362so6b/703/hls_vod_mvp.m3u8","summaryText":"Create ML is a new framework designed to help you easily build machine learning models using Swift and Xcode. Designed for Simplicity and Performance. Learn how you can build customized models from data that will enable new and powerful features in your apps using Create ML.","sessionDetail":"WWDC 2018 - Session 703 - iOS, macOS, tvOS, watchOS"},{"title":"Introducing MapKit JS","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/212/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/212nan45edr4qp/212/hls_vod_mvp.m3u8","summaryText":"MapKit JS brings Apple Maps to your website. See how MapKit JS provides map rendering that is optimized for various browsers and devices, and supports native gestures such as pinch-to-zoom, two-finger rotate, and more. Learn how to add annotations and overlays, and how to use JavaScript interfaces to Apple Maps services such as Search and Directions to deliver an amazing map experience on your website.","sessionDetail":"WWDC 2018 - Session 212 - iOS, macOS"},{"title":"Introducing Natural Language Framework","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/713/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/713u3ysohtlec95j3ir/713/hls_vod_mvp.m3u8","summaryText":"Natural Language is a redesigned framework designed to provide high-performance, on-device APIs for fundamental NLP tasks across all Apple platforms. Through the deep integration of the framework with Core ML and Create ML, you now have the ability to train custom NLP models to perform many different inferences and leverage the power of NLP in your apps. Join us for this exciting session to learn all the details and to see it in action.","sessionDetail":"WWDC 2018 - Session 713 - iOS, macOS, tvOS, watchOS"},{"title":"Introducing Network.framework: A modern alternative to Sockets","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/715/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/715o2fzpdzzzf5f0/715/hls_vod_mvp.m3u8","summaryText":"The new Network.framework API gives you direct access to the same high-performance user-space networking stack used by URLSession. If you're considering using Berkeley Sockets in your app or library, learn what better options are available to you.","sessionDetail":"WWDC 2018 - Session 715 - iOS, macOS, tvOS"},{"title":"Introduction to Siri Shortcuts","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/211/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/211fjjqs9t1cbwzwgf0/211/hls_vod_mvp.m3u8","summaryText":"Siri Shortcuts are a powerful new feature in iOS 12 that allow your app to expose its functionality to Siri. This enables Siri to suggest your shortcut at relevant times based on various context. Shortcuts can also be added to Siri to run with a voice phrase on iOS, HomePod and watchOS. Learn how to expose shortcuts in your app using NSUserActivity and discover the benefits of creating custom intents with SiriKit for a richer user experience.","sessionDetail":"WWDC 2018 - Session 211 - iOS, watchOS"},{"title":"Managing Documents In Your iOS Apps","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/216/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/216dvfcqmzmak5qs/216/hls_vod_mvp.m3u8","summaryText":"Last year we introduced the Files App and an easy way to view, edit, and share documents within your application. Learn best practices for implementing this technology, how to effectively manage documents in your app, and how to avoid common document manager pitfalls. Hear about the difference between a Document Browser and a Document Picker and when to use them. Gain a better understanding into how this technology works in a sandbox. Learn how to give your customers a great experience, beginning at sign-in and continuing throughout your app!","sessionDetail":"WWDC 2018 - Session 216 - iOS"},{"title":"New Ways to Work with Workouts","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/707/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/707liyrusj4qu2rj1z/707/hls_vod_mvp.m3u8","summaryText":"Tracking workouts with Apple Watch is popular with fitness professionals and novices alike.  See how the new workout API streamlines the entire lifecycle of a workout, complete with ability to restart a session after a crash to prevent you from losing data. Learn how the new workout classes, types, and queries provide quick access to baseline sample data you would typical calculate without limiting access to the fine grained samples you may occasionally require.","sessionDetail":"WWDC 2018 - Session 707 - iOS, watchOS"},{"title":"Optimizing Your App for Today’s Internet","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/714/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/714px070n75l8ri/714/hls_vod_mvp.m3u8","summaryText":"Learn what Apple has been doing to help your app get the most out of the network with the least effort. Let Apple's networking APIs do the heavy lifting for you. Learn best practices for getting top networking performance from your app using the URLSession APIs.","sessionDetail":"WWDC 2018 - Session 714 - iOS, macOS, tvOS, watchOS"},{"title":"Quick Look Previews from the Ground Up","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/237/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/237fjfpla4kbr1m/237/hls_vod_mvp.m3u8","summaryText":"Quicklook Previews are an easy way preview documents in your app. Hear about the basics as well as some advanced implementations. Learn to present a variety of types of documents from within your app without reinventing the wheel, and make sure your custom file format works great with the built-in support offered by iOS.","sessionDetail":"WWDC 2018 - Session 237 - iOS, macOS"},{"title":"Siri Shortcuts on the Siri Watch Face","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/217/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/217qlkasup9hplnx0r3/217/hls_vod_mvp.m3u8","summaryText":"Learn how to use Siri Shortcuts to bring glanceable information and custom interactions to the Siri watch face. Walk through how to create a compelling user experience by providing relevant shortcuts and by donating interactions from your app. See how these experiences can be created from both watchOS and iOS.","sessionDetail":"WWDC 2018 - Session 217 - iOS, watchOS"},{"title":"Strategies for Securing Web Content","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/207/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/207m5757sq9wfhvby/207/hls_vod_mvp.m3u8","summaryText":"Whether you use web content in your app via an embedded WebKit view, deliver pure web apps, or create web content to be embedded by others, it's important to ensure that you are using the most current web security standards. Learn techniques like such as special cookie attributes and HTTP response headers designed to secure your web content against the latest threats that include cross-site scripting, cross-site request forgeries, and speculative execution attacks, commonly known as Spectre.","sessionDetail":"WWDC 2018 - Session 207 - iOS, macOS, tvOS, watchOS"},{"title":"TextKit Best Practices","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/221/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/221dm4k4kaqjqapkxt/221/hls_vod_mvp.m3u8","summaryText":"Leverage the abilities of TextKit to provide the best experience possible displaying and editing text. Get the best performance out of your app by using TextKit effectively. Learn the concepts to do more complex handling, layout and presentation.","sessionDetail":"WWDC 2018 - Session 221 - iOS, macOS"},{"title":"The Life of a Button","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/804/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/804hwsr1us28uuau99o/804/hls_vod_mvp.m3u8","summaryText":"An in-depth exploration of essential interaction, visual and sound design principles and techniques through the design of a simple button.","sessionDetail":"WWDC 2018 - Session 804 - iOS, macOS, tvOS, watchOS"},{"title":"The Qualities of Great Design","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/801/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/801srpnrtij2lqi6/801/hls_vod_mvp.m3u8","summaryText":"Great Design isn't magic, it is crafted with care by real people. Explore the characteristics of great design through the voices of designers from Apple and our developer community. Learn how they take inspiration from everyday life, conceive and refine ideas, and push themselves to design apps and games that can stand the test of time.","sessionDetail":"WWDC 2018 - Session 801 - iOS, macOS, tvOS, watchOS"},{"title":"Tips for Great Maps","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/810/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/810yhhz7j3k7d7y/810/hls_vod_mvp.m3u8","summaryText":"Maps are powerful tools for conveying information. Learn key cartographic principles that will help you create beautiful, useful maps so that your users can get the most out of your apps.","sessionDetail":"WWDC 2018 - Session 810 - iOS, macOS"},{"title":"UIKit: Apps for Every Size and Shape","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/235/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/235gkyrtsva0gy/235/hls_vod_mvp.m3u8","summaryText":"Ground-up coverage of how to make an app that can fit on devices of every size and shape. Make your app fit beautifully on Apple's full range of devices with the minimum amount of effort, future-proofing your user experience along the way.","sessionDetail":"WWDC 2018 - Session 235 - iOS"},{"title":"Using Accelerate and simd","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/701/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/701bd0jri1hppm1q4/701/hls_vod_mvp.m3u8","summaryText":"Learn how to use sophisticated Signal and Image Processing techniques to bring higher performance to your apps while lowering battery consumption.  See compelling use cases for the Accelerate framework with interactive demos. Explore using simd—a valuable addition that effortlessly brings vector programming to your apps.","sessionDetail":"WWDC 2018 - Session 701 - iOS, macOS, tvOS, watchOS"},{"title":"Using Grouped Notifications","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/711/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/711c5be5c6ma8yy/711/hls_vod_mvp.m3u8","summaryText":"Grouping the notifications your app sends helps people get more information at a glance and manage multiple notifications at once. Learn how to implement Grouped Notifications in your app.","sessionDetail":"WWDC 2018 - Session 711 - iOS"},{"title":"Wallet and Apple Pay: Creating Great Customer Experiences","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/720/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/720gofzcqcp431kcasf/720/hls_vod_mvp.m3u8","summaryText":"Get the latest news and updates from the Wallet and Apple Pay team. Learn how iPhone and Apple Watch can power innovative commerce experiences. Hear about the latest design best practices for Apple Pay. And discover how to create your own contactless passes for rewards cards, gift cards, tickets and more.","sessionDetail":"WWDC 2018 - Session 720 - iOS, macOS, watchOS"},{"title":"What's New in Cocoa Touch","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/202/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/202gr4vfnb8iayqu/202/hls_vod_mvp.m3u8","summaryText":"iOS 12 enhances the Cocoa Touch frameworks to improve app performance and deliver exciting new features. Learn about performance best practices, security improvements, tools for supporting multiple screen sizes and shapes, new APIs for iMessage apps, Siri Shortcuts, and Swift refinements. Find out which sessions you won't want to miss throughout the week.","sessionDetail":"WWDC 2018 - Session 202 - iOS"},{"title":"What's New in TVMLKit","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/238/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/238l85zhwz7192hqb/238/hls_vod_mvp.m3u8","summaryText":"With TVMLKit you can quickly and easily develop tvOS apps that deliver intuitive and engaging media experiences. Learn about enhancements to data binding that allow you to separate your application logic and user interface, and new features and functions to customize the media playback experience.","sessionDetail":"WWDC 2018 - Session 238 - tvOS"},{"title":"What's New in tvOS 12","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/208/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/208piymryv9im6/208/hls_vod_mvp.m3u8","summaryText":"Apps on tvOS entertain, inform, and inspire with their content and interactive experiences. tvOS 12 brings new technologies that help make these experiences even more enjoyable and engaging. Get an introduction to focus engine support for non-UIKit apps, new UI elements, and Password AutoFill. Learn how to bring it all together to create incredible tvOS apps and experiences.","sessionDetail":"WWDC 2018 - Session 208 - tvOS"},{"title":"What’s New in Core ML, Part 1","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/708/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/708ax570wjtpxze/708/hls_vod_mvp.m3u8","summaryText":"Introduced just one year ago, Core ML has already revolutionized the way apps can benefit from machine learning, by enabling fast and private on device machine learning features for your app. Find out how new Core ML features let you reduce the size of models, make them more flexible, and dramatically improve performance.","sessionDetail":"WWDC 2018 - Session 708 - iOS, macOS, tvOS, watchOS"},{"title":"What’s New in Core ML, Part 2","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/709/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/709ofa44hqrgje7a4c/709/hls_vod_mvp.m3u8","summaryText":"The Core ML tools ecosystem gives you many options for building and optimizing models to meet your app requirements. Learn how to add flexibility to existing models, quantize them, and take advantage of Core ML's support for customization.","sessionDetail":"WWDC 2018 - Session 709 - iOS, macOS, tvOS, watchOS"},{"title":"What’s New in Safari and WebKit","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/234/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/234iphi7iwpe8ew16w/234/hls_vod_mvp.m3u8","summaryText":"Safari and WebKit are continually evolving with new features, APIs, and cutting edge web standards. Learn about this year's biggest feature highlights, designed to help you create richer experiences with better performance and security — whether you are developing content for a browser or developing an app with embedded web content.","sessionDetail":"WWDC 2018 - Session 234 - iOS, macOS"},{"title":"What’s New in User Notifications","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/710/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/710kz0ncc1u8bfxn6/710/hls_vod_mvp.m3u8","summaryText":"Local and push notifications enable your app to keep users informed with timely and relevant content, by displaying messages and accepting users' actions, or playing distinctive sounds, or updating the badge on your app icon. Improvements to rich notifications help you create more engaging content and better manage notifications. Find out what's new and get expert advice on implementing user notifications in your app.","sessionDetail":"WWDC 2018 - Session 710 - iOS, watchOS"},{"title":"Your Apps and the Future of macOS Security","genre":"Frameworks","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/702/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/702zi9t7twhu9310kz5/702/hls_vod_mvp.m3u8","summaryText":"Apple is on a mission to advance the state of Mac security, and we want your apps to be there with us. Learn about new protections for user data, new capabilities with Developer ID, and how you can best secure your apps.","sessionDetail":"WWDC 2018 - Session 702 - macOS"},{"title":"Core Image: Performance, Prototyping, and Python","genre":"Graphics and Games","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/719/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/719mml6x0gqj3b7udf/719/hls_vod_mvp.m3u8","summaryText":"Core Image is the essential framework for handling image processing tasks in your photo and video apps. In this session, we'll explore new additions to the framework that allow you to achieve great performance in your filter chains and custom CIKernels. We'll also demo a new approach to prototyping in Core Image through the use of an interactive Python environment. Through these techniques you'll discover new ideas for building new creative effects as well as practical approaches to batch processing images for tasks such as image compositing and data boosting for machine learning.","sessionDetail":"WWDC 2018 - Session 719 - iOS, macOS"},{"title":"Creating Great AR Experiences","genre":"Graphics and Games","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/805/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/805llmiw0zwkox4zhuc/805/hls_vod_mvp.m3u8","summaryText":"Engaging AR experiences are easy to start and navigate, persuasively realistic, and highly immersive. Learn best practices for successfully bringing people into an AR experience, teaching them about how to interact and engage with virtual content, and making your AR content look beautiful and grounded in the real world.","sessionDetail":"WWDC 2018 - Session 805 - iOS"},{"title":"Inside SwiftShot: Creating an AR Game","genre":"Graphics and Games","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/605/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/605sgm2hb3oxmy/605/hls_vod_mvp.m3u8","summaryText":"Developed by Apple, SwiftShot is an energetic and immersive multiplayer AR game built with key iOS technologies. Glimpse behind the curtain and see how SwiftShot was designed and developed using ARKit, SceneKit, and Swift. Understand the intricacies of designing great gameplay for AR, and learn practical techniques for multiplayer synchronization and physics simulation.","sessionDetail":"WWDC 2018 - Session 605 - iOS"},{"title":"Integrating Apps and Content with AR Quick Look","genre":"Graphics and Games","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/603/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/603augiuv41xoowslk8/603/hls_vod_mvp.m3u8","summaryText":"With iOS 12, ARKit includes a built-in viewer for displaying and sharing high-quality 3D content using Pixar's usdz file format. Get introduced to the capabilities of AR Quick Look and see how to easily integrate AR into your app. Learn best practices for preparing 3D models for AR, and see how to deliver usdz content for viewing across Safari, Mail, Messages, and other built-in apps.","sessionDetail":"WWDC 2018 - Session 603 - iOS"},{"title":"Metal Game Performance Optimization","genre":"Graphics and Games","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/612/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/612wlpc4tnd47e9245/612/hls_vod_mvp.m3u8","summaryText":"Realize the full potential of your Metal-based games by tackling common issues that cause frame rate slowdowns, stutters, and stalls. Discover how to clear up jitter and maintain a silky-smooth frame rate with simple changes in frame pacing. Get introduced to new tools for analyzing rendering passes and pinpoint expensive or unexpected work. Learn how to avoid thread stalls and get specific advice about handling thermal notifications.","sessionDetail":"WWDC 2018 - Session 612 - iOS, macOS"},{"title":"Metal Shader Debugging and Profiling","genre":"Graphics and Games","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/608/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/608u6qpg6mh0uq/608/hls_vod_mvp.m3u8","summaryText":"Metal provides powerful tools for analyzing shader behavior and optimizing performance. Dive into troubleshooting vertex-stage problems with new geometry viewing capabilities in Xcode. Use the shader debugger to step through vertex, fragment, and compute shader execution line-by-line. Get details about analyzing GPU workload, and check out shader profiler enhancements for A11 Bionic.","sessionDetail":"WWDC 2018 - Session 608 - iOS, macOS, tvOS"},{"title":"Metal for Game Developers","genre":"Graphics and Games","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/607/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/607buro3d9jn66/607/hls_vod_mvp.m3u8","summaryText":"Metal 2 is Apple-designed graphics software that lets developers build console‑style games. Learn key aspects of the Metal architecture that support the techniques for modern high-performance game rendering. See how Metal now enables the GPU to schedule work for itself, allowing complete scenes and compute workloads to be built and executed with little to no CPU interaction. Understand how the seamless integration of Metal 2 with the A11 Bionic chip lets your apps and games realize entirely new levels of performance and capability.","sessionDetail":"WWDC 2018 - Session 607 - iOS, macOS, tvOS"},{"title":"Metal for OpenGL Developers","genre":"Graphics and Games","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/604/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/604lh97z18yv96g6nhf/604/hls_vod_mvp.m3u8","summaryText":"Metal is the foundation for accelerated graphics and compute on Apple platforms, enabling your apps and games to tap into the incredible power of the GPU. Get introduced to essential Metal capabilities and understand the recommended approach for transitioning OpenGL-based apps onto the Metal API.","sessionDetail":"WWDC 2018 - Session 604 - iOS, macOS, tvOS"},{"title":"Metal for Ray Tracing Acceleration","genre":"Graphics and Games","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/606/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/606id8hzoex3kf/606/hls_vod_mvp.m3u8","summaryText":"Metal Performance Shaders (MPS) harnesses the massive parallelism of the GPU to dramatically accelerate calculations at the heart of modern ray tracing and ray casting techniques. See how ray tracing can provide greater realism in 3D scenes through improved shading, soft shadows, and global illumination. Understand how MPS accelerates ray-triangle intersections while enabling dynamic scene updates, and learn how to extend your app across multiple GPUs for even greater performance.","sessionDetail":"WWDC 2018 - Session 606 - iOS, macOS"},{"title":"Metal for VR","genre":"Graphics and Games","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/611/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/611q31k82j69jxqw/611/hls_vod_mvp.m3u8","summaryText":"On macOS, Metal 2 adds specialized support for virtual reality (VR) rendering and external GPUs. Learn about new features and optimizations to take advantage of these technologies within your Metal 2-based apps and games. Understand best practices for scheduling workloads across multiple GPUs and techniques for frame pacing while multi-threading.","sessionDetail":"WWDC 2018 - Session 611 - macOS"},{"title":"Prototyping for AR","genre":"Graphics and Games","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/808/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/808j4pqwu6uymymjq/808/hls_vod_mvp.m3u8","summaryText":"Designing for AR can be intimidating and discovering design flaws late in the process can be costly. See how low-tech traditional prototyping techniques can help you validate and refine your AR app and game design ideas.","sessionDetail":"WWDC 2018 - Session 808 - iOS"},{"title":"Understanding ARKit Tracking and Detection","genre":"Graphics and Games","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/610/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/610qbth3em1ngixst/610/hls_vod_mvp.m3u8","summaryText":"With ARKit your app can see the world and place virtual objects on horizontal and vertical surfaces and recognize images and objects. Go beyond the API to gain insights into the innovative methods and techniques underlying these capabilities. See how ARKit combines device motion with the camera to provide accurate tracking and plane detection. Get a deeper understanding of persistence and multi-device AR and learn the recommended approach for image tracking and object detection.","sessionDetail":"WWDC 2018 - Session 610 - iOS"},{"title":"What’s New in ARKit 2","genre":"Graphics and Games","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/602/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/602r0zx2q17fqbk/602/hls_vod_mvp.m3u8","summaryText":"ARKit 2 makes it easy to develop vivid augmented reality experiences and enable apps to interact with the real world in entirely new ways. Discover how multiple iOS devices can simultaneously view an AR scene or play multiplayer AR games. Learn about new capabilities for tracking 2D images, and see how to detect known 3D objects like sculptures, toys, and furniture.","sessionDetail":"WWDC 2018 - Session 602 - iOS"},{"title":"AVContentKeySession Best Practices","genre":"Media","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/507/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/507axjplrd0yjzixfz/507/hls_vod_mvp.m3u8","summaryText":"AVContentKeySession allows for the management of FairPlay content decryption keys for HTTP Live Streaming. It offers a simplified key loading process that provides applications with control over the lifecycle of content keys, and features such as dual-expiry keys for offline movie rentals. Learn about best practices and recommended patterns for adopting this API.","sessionDetail":"WWDC 2018 - Session 507 - iOS, tvOS"},{"title":"Creating Audio Apps for watchOS","genre":"Media","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/504/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/504uv2gj8r9250n/504/hls_vod_mvp.m3u8","summaryText":"Apps in watchOS 5 have control over audio playback like never before.  With a full-fledged background mode for local audio playback using AVFoundation, people can listen to content on the go right from Apple Watch. Learn how to use the new volume control and how to respond to MediaRemote commands. Dive into best practices for getting audio onto Apple Watch with URLSession and update progress when using WatchConnectivity to transfer files from iPhone. Explore how to control playback on iPhone from your app with the new Now Playing view.","sessionDetail":"WWDC 2018 - Session 504 - watchOS"},{"title":"Creating Photo and Video Effects Using Depth","genre":"Media","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/503/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/503rfgg72ckqxj2fi/503/hls_vod_mvp.m3u8","summaryText":"The TrueDepth camera in the iPhone X streams high-quality depth data in real time allowing you to enhance your photo and video apps in fun and creative ways. Dive deep into the principles and best practices for working with depth data, learn how to use the new Portrait Segmentation API for still images, and see how these techniques can create special effects like background replacement and perspective changes.","sessionDetail":"WWDC 2018 - Session 503 - iOS"},{"title":"Image and Graphics Best Practices","genre":"Media","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/219/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/219mybpx95zm9x/219/hls_vod_mvp.m3u8","summaryText":"Whether it's for UI elements or a fundamental part of your application, at some point, you have to handle images. This session is packed with engaging insight into how images are handled in iOS including discussion of UIImage, UIImageView, custom drawing in UIKit, plus advanced CPU and GPU techniques that can help you maximize performance and minimize memory footprint.","sessionDetail":"WWDC 2018 - Session 219 - iOS"},{"title":"Integrating with Photos on macOS","genre":"Media","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/505/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/505em1a6u6lq35/505/hls_vod_mvp.m3u8","summaryText":"Make your apps even better through improved integration with Photos on macOS. We'll dive deep into the Photos Project Extension API that was introduced in macOS High Sierra and update you on what's new. You'll also learn best practices for handling file promises and image URLs to better handle drag & drop from Photos to your app.","sessionDetail":"WWDC 2018 - Session 505 - macOS"},{"title":"Introducing Podcast Analytics","genre":"Media","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/501/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/501rzej45eysiycpu/501/hls_vod_mvp.m3u8","summaryText":"Podcasts are created and enjoyed by millions of people around the world. With the addition of Podcast Analytics, podcasters can gather actionable and insightful intelligence into how their show is consumed, while respecting the privacy of their listeners. Learn how to interpret and use these new analytics to improve your show.","sessionDetail":"WWDC 2018 - Session 501 - iOS, macOS, watchOS"},{"title":"Live Screen Broadcast with ReplayKit","genre":"Media","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/601/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/601nz4m863hyf0/601/hls_vod_mvp.m3u8","summaryText":"ReplayKit 2 provides built-in services for broadcasting your screen from iOS and tvOS to viewers online. See how broadcasts can be started right within Control Center or from standard UI included in your own apps and games. Hear about developing broadcast extensions for ReplayKit 2 and get best practices for handling account sign-in.","sessionDetail":"WWDC 2018 - Session 601 - iOS, tvOS"},{"title":"Measuring and Optimizing HLS Performance","genre":"Media","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/502/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/502plwzfxg5p7w4na/502/hls_vod_mvp.m3u8","summaryText":"HTTP Live Streaming (HLS) is used to stream live and on-demand content to global audiences. Discover how to adjust and tune stream authoring and delivery elements to improve the viewing experience. Learn how to accurately measure your streaming performance, identify optimization opportunities, and implement changes to your HLS streams that can significantly improve the user experience.","sessionDetail":"WWDC 2018 - Session 502 - iOS, macOS, tvOS"},{"title":"MusicKit on the Web","genre":"Media","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/506/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/506dgb08enfpgn2c58s/506/hls_vod_mvp.m3u8","summaryText":"MusicKit has enabled the creation of new, compelling, and engaging Apple Music powered app experiences. With the introduction of MusicKit on the web, as a developer, you can now bring Apple Music powered experiences to the web. Learn how to use declarative markup or javascript to enable Apple Music on your website.","sessionDetail":"WWDC 2018 - Session 506 - iOS, macOS"},{"title":"Object Tracking in Vision","genre":"Media","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/716/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/716xqb0exkswff/716/hls_vod_mvp.m3u8","summaryText":"Vision is a high-level framework that provides an easy to use API for handling many computer vision tasks. We'll dive deep into a particularly powerful feature of Vision—tracking objects in video streams. Learn best practices for using Vision in your app. Gain a greater understanding of how request handlers function in terms of lifecycle, performance, and memory utilization.","sessionDetail":"WWDC 2018 - Session 716 - iOS, macOS"},{"title":"Vision with Core ML","genre":"Media","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/717/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/717nagdm5s7ynqf/717/hls_vod_mvp.m3u8","summaryText":"Using Core ML models in Vision makes the creation of powerful Computer Vision applications easy. Learn how easy it is to use custom trained classifiers and object recognition models in a live camera capture. In addition, you'll learn about the latest additions to the Vision Framework along with a deeper dive into some its fundamentals.","sessionDetail":"WWDC 2018 - Session 717 - iOS, macOS"},{"title":"What's New in watchOS","genre":"Media","url":"https://developer.apple.com/videos/wwdc2018/videos/play/wwdc2018/206/","m3uUrl":"https://devstreaming-cdn.apple.com/videos/wwdc/2018/206jn5qnngdzy9/206/hls_vod_mvp.m3u8","summaryText":"watchOS 5 makes creating great experiences on Apple Watch easier than ever before. Learn about robust capabilities to create rich and interactive notifications, a new background mode and controls for audio playback, shortcuts that bring your apps to the Siri watch face, and more. See what's new in watchOS and discover how to expand your app's presence on the wrist.","sessionDetail":"WWDC 2018 - Session 206 - watchOS"}]